# Import libraries

In [1]:
# Import libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Set visualization style for plots
sns.set_style("whitegrid")

# Set display options for better readability
pd.set_option("display.max_colwidth", None)

# Load dataset files

In [3]:
# Load file containing dataset features
features = pd.read_csv(
    "Datasets/UNSW-NB15 - Features.csv",
    encoding="latin-1"
)

# Preview DataFrame
features.head()

   No.    Name    Type               Description
0    1   srcip  nominal        Source IP address
1    2   sport  integer       Source port number
2    3   dstip  nominal   Destination IP address
3    4  dsport  integer  Destination port number
4    5   proto  nominal     Transaction protocol

In [4]:
# Load all 4 data files
df1 = pd.read_csv(
    "Datasets/UNSW-NB15 - 1.csv",
    header=None,
    low_memory=False
)
df2 = pd.read_csv(
    "Datasets/UNSW-NB15 - 2.csv",
    header=None,
    low_memory=False
)
df3 = pd.read_csv(
    "Datasets/UNSW-NB15 - 3.csv",
    header=None,
    low_memory=False
)
df4 = pd.read_csv(
    "Datasets/UNSW-NB15 - 4.csv",
    header=None,
    low_memory=False
)

# Preview first data file
df1.head()

,0,1,2,3,4,5,6,7,8,9,...,39,40,41,42,43,44,45,46,47,48
0,59.166.0.0,1390,149.171.126.6,53,udp,CON,0.001055,132,164,31,...,0,3,7,1,3,1,1,1,NaN,0
1,59.166.0.0,33661,149.171.126.9,1024,udp,CON,0.036133,528,304,31,...,0,2,4,2,3,1,1,2,NaN,0
2,59.166.0.6,1464,149.171.126.7,53,udp,CON,0.001119,146,178,31,...,0,12,8,1,2,2,1,1,NaN,0
3,59.166.0.5,3593,149.171.126.5,53,udp,CON,0.001209,132,164,31,...,0,6,9,1,1,1,1,1,NaN,0
4,59.166.0.3,49664,149.171.126.0,53,udp,CON,0.001169,146,178,31,...,0,7,9,1,1,1,1,1,NaN,0